<a href="https://colab.research.google.com/github/matsunori39/Introduction-to-SQL-3rd-Edition/blob/main/Introduction_to_SQL_3rd_Edition.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

https://book.impress.co.jp/books/1121101090

In [1]:
!pip install ipython-sql -q

In [2]:
# Loading ipython-sql
%load_ext sql

# Connecting to SQLite
%sql sqlite:///tmp.sqlite3

'Connected: @tmp.sqlite3'

# Part1 Getting Started with SQL

## Chapter 1 First SQL

### 1.2 First SQL

#### 1.2.1 Try SQL

In [3]:
%%sql
CREATE TABLE book (
  date DATE,
  item VARCHAR(30),
  memo VARCHAR(30),
  received INT,
  payment INT);
INSERT INTO book (date, item, memo, received, payment) VALUES ('2022-02-03', 'food expense' , 'buy coffee' , 0, 380);
INSERT INTO book (date, item, memo, received, payment) VALUES ('2022-02-10', 'salary' , 'Jan. salary' , 280000, 0);
INSERT INTO book (date, item, memo, received, payment) VALUES ('2022-02-11', 'culture and recreation expenses' , 'buy books' , 0, 2800);
INSERT INTO book (date, item, memo, received, payment) VALUES ('2022-02-14', 'entertainment expenses' , 'dues for synchronization meetings' , 0, 5000);
INSERT INTO book (date, item, memo, received, payment) VALUES ('2022-02-18', 'utilities charge' , 'electricity bill in Jan.' , 0, 7560);

 * sqlite:///tmp.sqlite3
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

#### 1.2.2 Let's search

In [4]:
%%sql
SELECT payment
  FROM book

 * sqlite:///tmp.sqlite3
Done.

[(380,), (0,), (2800,), (5000,), (7560,)]